:PROPERTIES:
:ID:       328F5610-DF7E-4F97-B7A5-216B83696C51
:END:
#+title: cd-ripping

What tools to use nowadays?

This feels like an area that isn't likely to get active attention
other than some integrations to pieces that may still be moving such
as codecs.

* abcde

This is what I was using fairly recently...but the brew formula has since been deprecated :/
https://formulae.brew.sh/formula/abcde
Unfortunately they don't offer an alternative.

At the moment I don't have any deep requirements (FLAC ripping and ideally CD information retrieval),
so I'll see if other options are more readily usable.

** (un)installation

*** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :session brew :async
  brew uninstall abcde
#+end_src

#+RESULTS:
#+begin_example
brew uninstall abcde
Uninstalling /opt/homebrew/Cellar/abcde/2.9.3_1.reinstall... (295 files, 3.4MB)
==> Autoremoving 19 unneeded formulae:
cdrtools
doxygen
eye-d3
flex
gdbm
glyr
gperf
libcanberra
libdiscid
libevent
libnghttp2
mkcue
ninja
openldap
perl
python-packaging
python@3.13
unbound
vorbis-tools
Uninstalling /opt/homebrew/Cellar/glyr/1.0.10_3... (18 files, 366.7KB)
Uninstalling /opt/homebrew/Cellar/vorbis-tools/1.4.3... (20 files, 677.9KB)
Uninstalling /opt/homebrew/Cellar/python-packaging/26.2... (64 files, 808.5KB)
Uninstalling /opt/homebrew/Cellar/libcanberra/0.30... (22 files, 387.2KB)
Uninstalling /opt/homebrew/Cellar/mkcue/1... (7 files, 85.8KB)
Uninstalling /opt/homebrew/Cellar/python@3.13/3.13.13_1... (3,620 files, 72.3MB)
Uninstalling /opt/homebrew/Cellar/perl/5.42.2... (2,862 files, 71.8MB)
Uninstalling /opt/homebrew/Cellar/libdiscid/0.6.5... (12 files, 163.5KB)
Uninstalling /opt/homebrew/Cellar/gperf/3.3... (12 files, 596.2KB)
Uninstalling /opt/homebrew/Cellar/ninja/1.13.2... (10 files, 438KB)
Uninstalling /opt/homebrew/Cellar/cdrtools/3.02a09... (210 files, 6.4MB)
Uninstalling /opt/homebrew/Cellar/eye-d3/0.9.9... (197 files, 1.7MB)
Uninstalling /opt/homebrew/Cellar/doxygen/1.17.0... (10 files, 23.4MB)
Uninstalling /opt/homebrew/Cellar/unbound/1.25.1... (59 files, 6.6MB)

Warning: The following unbound configuration files have not been removed!
If desired, remove them manually with `rm -rf`:
  /opt/homebrew/etc/unbound
  /opt/homebrew/etc/unbound/unbound.conf
  /opt/homebrew/etc/unbound/unbound.conf.default
Uninstalling /opt/homebrew/Cellar/openldap/2.6.13... (342 files, 9.1MB)

Warning: The following openldap configuration files have not been removed!
If desired, remove them manually with `rm -rf`:
  /opt/homebrew/etc/openldap
  /opt/homebrew/etc/openldap/ldap.conf
  /opt/homebrew/etc/openldap/ldap.conf.default
  /opt/homebrew/etc/openldap/schema
  /opt/homebrew/etc/openldap/schema/README
  /opt/homebrew/etc/openldap/schema/README.default
  /opt/homebrew/etc/openldap/schema/collective.ldif
  /opt/homebrew/etc/openldap/schema/collective.ldif.default
  /opt/homebrew/etc/openldap/schema/collective.schema
  /opt/homebrew/etc/openldap/schema/collective.schema.default
  /opt/homebrew/etc/openldap/schema/corba.ldif
  /opt/homebrew/etc/openldap/schema/corba.ldif.default
  /opt/homebrew/etc/openldap/schema/corba.schema
  /opt/homebrew/etc/openldap/schema/corba.schema.default
  /opt/homebrew/etc/openldap/schema/core.ldif
  /opt/homebrew/etc/openldap/schema/core.ldif.default
  /opt/homebrew/etc/openldap/schema/core.schema
  /opt/homebrew/etc/openldap/schema/core.schema.default
  /opt/homebrew/etc/openldap/schema/cosine.ldif
  /opt/homebrew/etc/openldap/schema/cosine.ldif.default
  /opt/homebrew/etc/openldap/schema/cosine.schema
  /opt/homebrew/etc/openldap/schema/cosine.schema.default
  /opt/homebrew/etc/openldap/schema/dsee.ldif
  /opt/homebrew/etc/openldap/schema/dsee.ldif.default
  /opt/homebrew/etc/openldap/schema/dsee.schema
  /opt/homebrew/etc/openldap/schema/dsee.schema.default
  /opt/homebrew/etc/openldap/schema/duaconf.ldif
  /opt/homebrew/etc/openldap/schema/duaconf.ldif.default
  /opt/homebrew/etc/openldap/schema/duaconf.schema
  /opt/homebrew/etc/openldap/schema/duaconf.schema.default
  /opt/homebrew/etc/openldap/schema/dyngroup.ldif
  /opt/homebrew/etc/openldap/schema/dyngroup.ldif.default
  /opt/homebrew/etc/openldap/schema/dyngroup.schema
  /opt/homebrew/etc/openldap/schema/dyngroup.schema.default
  /opt/homebrew/etc/openldap/schema/inetorgperson.ldif
  /opt/homebrew/etc/openldap/schema/inetorgperson.ldif.default
  /opt/homebrew/etc/openldap/schema/inetorgperson.schema
  /opt/homebrew/etc/openldap/schema/inetorgperson.schema.default
  /opt/homebrew/etc/openldap/schema/java.ldif
  /opt/homebrew/etc/openldap/schema/java.ldif.default
  /opt/homebrew/etc/openldap/schema/java.schema
  /opt/homebrew/etc/openldap/schema/java.schema.default
  /opt/homebrew/etc/openldap/schema/misc.ldif
  /opt/homebrew/etc/openldap/schema/misc.ldif.default
  /opt/homebrew/etc/openldap/schema/misc.schema
  /opt/homebrew/etc/openldap/schema/misc.schema.default
  /opt/homebrew/etc/openldap/schema/msuser.ldif
  /opt/homebrew/etc/openldap/schema/msuser.ldif.default
  /opt/homebrew/etc/openldap/schema/msuser.schema
  /opt/homebrew/etc/openldap/schema/msuser.schema.default
  /opt/homebrew/etc/openldap/schema/namedobject.ldif
  /opt/homebrew/etc/openldap/schema/namedobject.ldif.default
  /opt/homebrew/etc/openldap/schema/namedobject.schema
  /opt/homebrew/etc/openldap/schema/namedobject.schema.default
  /opt/homebrew/etc/openldap/schema/nis.ldif
  /opt/homebrew/etc/openldap/schema/nis.ldif.default
  /opt/homebrew/etc/openldap/schema/nis.schema
  /opt/homebrew/etc/openldap/schema/nis.schema.default
  /opt/homebrew/etc/openldap/schema/openldap.ldif
  /opt/homebrew/etc/openldap/schema/openldap.ldif.default
  /opt/homebrew/etc/openldap/schema/openldap.schema
  /opt/homebrew/etc/openldap/schema/openldap.schema.default
  /opt/homebrew/etc/openldap/schema/pmi.ldif
  /opt/homebrew/etc/openldap/schema/pmi.ldif.default
  /opt/homebrew/etc/openldap/schema/pmi.schema
  /opt/homebrew/etc/openldap/schema/pmi.schema.default
  /opt/homebrew/etc/openldap/slapd.conf
  /opt/homebrew/etc/openldap/slapd.conf.default
  /opt/homebrew/etc/openldap/slapd.conf.default.default
  /opt/homebrew/etc/openldap/slapd.ldif
  /opt/homebrew/etc/openldap/slapd.ldif.default
  /opt/homebrew/etc/openldap/slapd.ldif.default.default
Uninstalling /opt/homebrew/Cellar/flex/2.6.4_2... (46 files, 1.6MB)
Uninstalling /opt/homebrew/Cellar/gdbm/1.26... (25 files, 1.1MB)
Uninstalling /opt/homebrew/Cellar/libnghttp2/1.69.0... (14 files, 848.6KB)
Uninstalling /opt/homebrew/Cellar/libevent/2.1.12_1... (57 files, 2.3MB)
[?2004hecho 'ob_comint_async_shell_end_d3d5a201-83a7-4b11-8f27-85262bbcb95d'[?2004l
#+end_example

* cdparanoia

An option I used not that long ago was cdparanoia, it looks like
there's a [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]] option
https://formulae.brew.sh/formula/libcdio-paranoia#default.

Quickly looking at the options it doesn't look like scratches all of
the itches out of the box and so may be part of a larger toolbox but
I'll try to start with something more self-contained.

#+begin_src shell :session brew :async
  brew install libcdio-paranoia
#+end_src

#+RESULTS:
: brew install libcdio-paranoia
: ✔︎ JSON API packages.arm64_tahoe.jws.json
: Warning: libcdio-paranoia 10.2-2.0.2 is already installed and up-to-date.
: To reinstall 10.2-2.0.2, run:
:   brew reinstall libcdio-paranoia
: [?2004hecho 'ob_comint_async_shell_end_64dc8c84-433a-4508-9ae8-383129ea03f7'[?2004l

For whatever reason this seems to print to stderr, so we'll make use
of [[id:4BB51003-3806-4D02-8191-A8B596690E33][redirecting-in-ob-blocks]].

#+begin_src shell :results output :prologue "exec 2>&1"
  cd-paranoia --version
#+end_src

#+RESULTS:
: cdparanoia III release 10.2 libcdio 2.2.0 aarch64-apple-darwin25.0.0
: (C) 2001 Monty <monty@xiph.org> and Xiphophorus
: (C) 2004, 2005, 2008 Rocky Bernstein <rocky@gnu.org>
: (C) 2014 Robert Kausch <robert.kausch@freac.org>
: 
: Report bugs to bug-libcdio@gnu.org
: 

** Help

#+begin_src shell :results output
  cd-paranoia --help
#+end_src

#+RESULTS:
#+begin_example
USAGE:
  cd-paranoia [options] <span> [outfile]

OPTIONS:
  -A --analyze-drive              : run and log a complete analysis of drive
                                    caching, timing and reading behavior;
                                    verifies that cdparanoia is correctly
                                    modelling a specific drive's cache and
                                    read behavior. Implies -vQL

  -v --verbose                    : extra verbose operation
  -q --quiet                      : quiet operation
  -e --stderr-progress            : force output of progress information to
                                    stderr (for wrapper scripts)
  -l --log-summary         <file> : save result summary to file
  -L --log-debug           <file> : save detailed device autosense and
                                    debugging output to file
  -V --version                    : print version info and quit
  -Q --query                      : autosense drive, query disc and quit
  -B --batch                      : 'batch' mode (saves each track to a
                                    seperate file.
  -s --search-for-drive           : do an exhaustive search for drive
  -h --help                       : print help

  -p --output-raw                 : output raw 16 bit PCM in host byte 
                                    order
  -r --output-raw-little-endian   : output raw 16 bit little-endian PCM
  -R --output-raw-big-endian      : output raw 16 bit big-endian PCM
  -w --output-wav                 : output as WAV file (default)
  -f --output-aiff                : output as AIFF file
  -a --output-aifc                : output as AIFF-C file

  -c --force-cdrom-little-endian  : force treating drive as little endian
  -C --force-cdrom-big-endian     : force treating drive as big endian
  -n --force-default-sectors <n>  : force default number of sectors in read
                                    to n sectors
  -o --force-search-overlap  <n>  : force minimum overlap search during
                                    verification to n sectors
  -d --force-cdrom-device   <dev> : use specified device; disallow 
                                    autosense
  -k --force-cooked-device  <dev> : really an alias for -d. Kept for 
                                    compatibility.
  -g --force-generic-device <dev> : really an alias for -d. Kept for 
                                    compatibility.
  -S --force-read-speed <n>       : read from device at specified speed; by
                                    default, cdparanoia sets drive to full
                                    speed.
  -t --toc-offset <n>             : Add <n> sectors to the values reported
                                    when addressing tracks. May be negative
  -T --toc-bias                   : Assume that the beginning offset of 
                                    track 1 as reported in the TOC will be
                                    addressed as LBA 0.  Necessary for some
                                    Toshiba drives to get track boundaries
                                    correct
  -m --mmc-timeout <n>            : Set SCSI-MMC timeout to <n> seconds.
  -O --sample-offset <n>          : Add <n> samples to the offset when
                                    reading data.  May be negative.
  -z --never-skip[=n]             : never accept any less than perfect
                                    data reconstruction (don't allow 'V's)
                                    but if [n] is given, skip after [n]
                                    retries without progress.
  -Z --disable-paranoia           : disable all paranoia checking
  -Y --disable-extra-paranoia     : only do cdda2wav-style overlap checking
  -X --abort-on-skip              : abort on imperfect reads/skips
  -x --test-flags=mask            : simulate CD-reading errors of ilk-mask n
                                    mask & 0x10  - simulate underrun errors

OUTPUT SMILIES:
  :-)   Normal operation, low/no jitter
  :-|   Normal operation, considerable jitter
  :-/   Read drift
  :-P   Unreported loss of streaming in atomic read operation
  8-|   Finding read problems at same point during reread; hard to correct
  :-0   SCSI/ATAPI transport error
  :-(   Scratch detected
  ;-(   Gave up trying to perform a correction
  8-X   Aborted (as per -X) due to a scratch/skip
  :^D   Finished extracting

PROGRESS BAR SYMBOLS:
<space> No corrections needed
   -    Jitter correction required
   +    Unreported loss of streaming/other error in read
   !    Errors are getting through stage 1 but corrected in stage2
   e    SCSI/ATAPI transport error (corrected)
   V    Uncorrected error/skip

SPAN ARGUMENT:
The span argument may be a simple track number or a offset/span
specification.  The syntax of an offset/span takes the rough form:
  
                       1[ww:xx:yy.zz]-2[aa:bb:cc.dd] 

Here, 1 and 2 are track numbers; the numbers in brackets provide a
finer grained offset within a particular track. [aa:bb:cc.dd] is in
hours/minutes/seconds/sectors format. Zero fields need not be
specified: [::20], [:20], [20], [20.], etc, would be interpreted as
twenty seconds, [10:] would be ten minutes, [.30] would be thirty
sectors (75 sectors per second).

When only a single offset is supplied, it is interpreted as a starting
offset and ripping will continue to the end of he track.  If a single
offset is preceeded or followed by a hyphen, the implicit missing
offset is taken to be the start or end of the disc, respectively. Thus:

    1:[20.35]    Specifies ripping from track 1, second 20, sector 35 to 
                 the end of track 1.

    1:[20.35]-   Specifies ripping from 1[20.35] to the end of the disc

    -2           Specifies ripping from the beginning of the disc up to
                 (and including) track 2

    -2:[30.35]   Specifies ripping from the beginning of the disc up to
                 2:[30.35]

    2-4          Specifies ripping from the beginning of track two to the
                 end of track 4.

Don't forget to protect square brackets and preceeding hyphens from
the shell...

A few examples, protected from the shell:
  A) query only with exhaustive search for a drive and full reporting
     of autosense:
       cd-paranoia -vsQ

  B) extract up to and including track 3, putting each track in a separate
     file:
       cd-paranoia -B -- "-3"

  C) extract from track 1, time 0:30.12 to 1:10.00:
       cd-paranoia "[:30.12]-1[1:10]"

Submit bug reports to bug-libcdio@gnu.org

#+end_example

* Searching

[[id:0F384B87-44DD-4D61-8590-02F79024BB99][brew-search]]

#+begin_src shell :results output
  brew search --desc /
#+end_src

#+RESULTS:
#+begin_example
==> Formulae
abcde: Better CD Encoder
apache-flink-cdc: Flink CDC is a streaming data integration tool
argocd-autopilot: Opinionated way of installing Argo CD and managing GitOps repositories
argocd-vault-plugin: Argo CD plugin to retrieve secrets from Secret Management tools
autodiff: Automatic differentiation made easier for C++
bchunk: Convert CD images from .bin/.cue to .iso/.cdr
bde: Basic Development Environment: foundational C++ libraries used at Bloomberg
bedops: Set and statistical operations on genomic data of arbitrary scale
cake: Cross platform build automation system with a C# DSL
ccd2iso: Convert CloneCD images to ISO images
cd-discid: Read CD and get CDDB discid information
cdargs: Directory bookmarking system - Enhanced cd utilities
cdlabelgen: CD/DVD inserts and envelopes
cdrdao: Record CDs in Disk-At-Once mode
cdrtools: CD/DVD/Blu-ray premastering and recording software
cdsclient: Tools for querying CDS databases for astronomical data
checkdmarc: Command-line parser for SPF and DMARC DNS records
clickhouse-odbc: Official ODBC driver implementation for accessing ClickHouse as a data source
cloudquery: Data movement tool to sync data from any source to any destination
cozyhr: Cozy wrapper around Helm and Flux CD for local development
dagger: Portable devkit for CI/CD pipelines
datalad: Data distribution geared toward scientific datasets
datatype99: Algebraic data types for C99
dbmate: Lightweight, framework-agnostic database migration tool
ddclient: Update dynamic DNS entries
dvdrtools: Fork of cdrtools DVD writer support
dynomite: Generic dynamo implementation for different k-v storage engines
enzyme: High-performance automatic differentiation of LLVM
etcd-cpp-apiv3: C++ implementation for etcd's v3 client API, i.e., ETCDCTL_API=3
fiona: Reads and writes geographic data files
ford: Automatic documentation generator for modern Fortran programs
graphene: Thin layer of graphic data types
gtk-mac-integration: Integrates GTK macOS applications with the Mac desktop
iat: Converts many CD-ROM image formats to ISO9660
idsgrep: Grep for Extended Ideographic Description Sequences
inadyn: Dynamic DNS client with IPv4, IPv6, and SSL/TLS support
kitchen-sync: Fast efficiently sync database without dumping & reloading
lcdproc: Display real-time system information on a LCD
libcddb: CDDB server access library
libcdio-paranoia: CD paranoia on top of libcdio
libdap: Framework for scientific data networking
libdom: Implementation of the W3C DOM
libiptcdata: Virtual package provided by libiptcdata0
libmwaw: Library for converting legacy Mac document formats
libplctag: Portable and simple API for accessing AB PLC data over Ethernet
logswan: Fast Web log analyzer using probabilistic data structures
m1ddc: Control external displays (USB-C/DisplayPort Alt Mode) using DDC/CI on M1 Macs
mkcue: Generate a CUE sheet from a CD
mongo-c-driver: C driver for MongoDB
mongo-c-driver@1: C driver for MongoDB
nali: Tool for querying IP geographic information and CDN provider
nanoarrow: Helpers for Arrow C Data & Arrow C Stream interfaces
nco: Command-line operators for netCDF and HDF files
ncview: Visual browser for netCDF format files
netcdf: Libraries and data formats for array-oriented scientific data
netcdf-cxx: C++ libraries and utilities for NetCDF
netcdf-fortran: Fortran libraries and utilities for NetCDF
ocl-icd: OpenCL ICD loader
odbc2parquet: CLI to query an ODBC data source and write the result into a Parquet file
oksh: Portable OpenBSD ksh, based on the public domain Korn shell (pdksh)
open-mesh: Generic data structure to represent and manipulate polygonal meshes
opencl-icd-loader: OpenCL Installable Client Driver (ICD) Loader
openspec: Spec-driven development (SDD) for AI coding assistants
openvdb: Sparse volumetric data processing toolkit
pandoc-plot: Render and include figures in Pandoc documents using many plotting toolkits
pipelight: Self-hosted, lightweight CI/CD pipelines for small projects via CLI
pnetcdf: Parallel netCDF library for scientific data using the OpenMPI library
psqlodbc: Official PostgreSQL ODBC driver
ratchet: Tool for securing CI/CD workflows with version pinning
raven: Risk Analysis and Vulnerability Enumeration for CI/CD
redu: Ncdu for your restic repository
roapi: Full-fledged APIs for static datasets without writing a single line of code
sdb: Ondisk/memory hashtable based on CDB
souffle: Logic Defined Static Analysis
specify: Toolkit to help you get started with Spec-Driven Development
speex: Audio codec designed for speech
sqliteodbc: ODBC driver for SQLite
streamrip: Scriptable music downloader for Qobuz, Tidal, SoundCloud, and Deezer
surfer: Waveform viewer, supporting VCD, FST, or GHW format
tccutil: Utility to modify the macOS Accessibility Database (TCC.db)
tektoncd-cli: CLI for interacting with TektonCD
typical: Data interchange with algebraic data types
udis86: Minimalistic disassembler library for x86
varlock: Add declarative schema to .env files using @env-spec decorator comments
vcdimager: (Super) video CD authoring solution
veryfasttree: Efficient phylogenetic tree inference for massive taxonomic datasets
vulkan-loader: Vulkan ICD Loader
xkcd: Fetch latest, random or any particular xkcd comic right in your terminal
z: Tracks most-used directories to make cd smarter
z.lua: New cd command that helps you navigate faster by learning your habits

==> Casks
actual-odbc-pack: (Actual ODBC Driver Pack) Connect to enterprise databases using common desktop applications
affinity-designer: (Affinity Designer 2) Professional graphic design software
affinity-designer@1: (Affinity Designer) Professional graphic design software
audiobook-builder: (Audiobook Builder) Turn audio CDs and files into audiobooks
burn: (Burn) CD burning application
cd-to: (cd to) Finder Toolbar app to open the current directory in the Terminal
codeship-jet: (Codeship Jet) CI/CD as a service
dcp-o-matic-disk-writer: (DCP-o-matic Disk Writer) Convert video, audio and subtitles into DCP (Digital Cinema Package)
digital: (Digital) Logic designer and circuit simulator
drivethrurpg: (DriveThruRPG Library App) Sync DriveThruRPG libraries to compatible devices
eagle: (Autodesk EAGLE) Electronic design automation software
ealeksandrov-cd-to: (cd_to) Finder Toolbar app to open the current directory in the Terminal
ebmac: (EBMac) Electronic dictionary viewer
freac: (fre:ac) Audio converter and CD ripper
go-agent: (Go Agent, GoCD Agent) Agent for the Go Continuous Delivery platform
go-server: (Go Server, GoCD Server) Server for the Go Continuous Delivery platform
igv-desktop: (Integrative Genomics Viewer (IGV)) Visual exploration of genomic data
jetbrains-air: (JetBrains Air) Agentic development environment
kiro: (kiro) Agent-centric IDE with spec-driven development
klayout: (KLayout) IC design layout viewer and editor
logisim-evolution: (Logisim Evolution) Digital logic designer and simulator
lunacy: (Lunacy) Graphic design software
macdive: (MacDive) Digital dive log
macdown: (MacDown) Open-source Markdown editor
macdown-3000: (MacDown 3000) Markdown editor with live preview and syntax highlighting
macdroid: (MacDroid) Connect to your Android devices
mdb-accdb-viewer: (MDB/ACCDB Viewer) Open Microsoft Access Databases
mdrp: (Mac DVDRipper Pro) Utility to rip and copy DVD content
mic-drop: (Mic Drop) Quickly mute your microphone with a global shortcut or menu bar control
music-decoy: (Music Decoy) Music app blocker utility
ncar-ncl: (NCAR Command Language, ncl) Interpreted language for scientific data analysis and visualization
ovito: (OVITO) Scientific data visualization and analysis software
ovito-pro: (OVITO Pro) Scientific data visualization and analysis software
panoply: (Panoply netCDF, HDF and GRIB Data Viewer) Plot geo-referenced data from netCDF, HDF, and GRIB
qlnetcdf: (QLNetcdf) Quick Look plugin for viewing NetCDF files
scidavis: (SciDAVis) Application for scientific data analysis and visualization
spectra-app: (Spectra) OpenSpec document management desktop app
swiftdefaultappsprefpane: (SwiftDefaultApps) Replacement for RCDefaultApps, written in Swift
touchdesigner: (Derivative TouchDesigner) Tool for creating dynamic digital art
visit: (VisIt) Visualisation and data analysis for mesh-based scientific data
workbench: (Workbench) Seamless, automatic, “dotfile” sync to iCloud
ytmdesktop-youtube-music: (YouTube Music Desktop App) YouTube music client
#+end_example

* freac

Try this one based on search results and earlier quick searches.

#+begin_src shell :session brew :async
  brew trust --formula kde-mac/kde/kf5-attica kde-mac/kde/kf5-breeze-icons kde-mac/kde/kf5-kactivities kde-mac/kde/kf5-kauth kde-mac/kde/kf5-kcodecs kde-mac/kde/kf5-kcompletion kde-mac/kde/kf5-kconfig kde-mac/kde/kf5-kconfigwidgets kde-mac/kde/kf5-kcoreaddons kde-mac/kde/kf5-kcrash kde-mac/kde/kf5-kdbusaddons kde-mac/kde/kf5-kglobalaccel kde-mac/kde/kf5-kguiaddons kde-mac/kde/kf5-kiconthemes kde-mac/kde/kf5-kirigami2 kde-mac/kde/kf5-kitemmodels kde-mac/kde/kf5-kitemviews kde-mac/kde/kf5-kjobwidgets kde-mac/kde/kf5-knotifications kde-mac/kde/kf5-kpackage kde-mac/kde/kf5-kpty kde-mac/kde/kf5-kservice kde-mac/kde/kf5-kwallet kde-mac/kde/kf5-kwidgetsaddons kde-mac/kde/kf5-kwindowsystem kde-mac/kde/kf5-syntax-highlighting kde-mac/kde/phonon
  brew install freac
#+end_src

#+RESULTS:
#+begin_example
<de-mac/kde/kf5-kwidgetsaddons kde-mac/kde/kf5-kwindowsystem kde-mac/kde/kf5-syntax-highlighting kde-mac/kde/phonon
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-attica
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-breeze-icons
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kactivities
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kauth
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kcodecs
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kcompletion
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kconfig
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kconfigwidgets
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kcoreaddons
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kcrash
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kdbusaddons
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kglobalaccel
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kguiaddons
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kiconthemes
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kirigami2
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kitemmodels
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kitemviews
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kjobwidgets
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-knotifications
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kpackage
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kpty
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kservice
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kwallet
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kwidgetsaddons
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-kwindowsystem
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/kf5-syntax-highlighting
Trusted formula: https://invent.kde.org/packaging/homebrew-kde.git/phonon
brew install freac
Warning: Not upgrading freac, the latest version is already installed
[?2004hecho 'ob_comint_async_shell_end_8ab1f843-ba48-425f-9c5d-fc15791b3561'[?2004l
#+end_example

#+begin_src shell :results output
  brew list freac
#+end_src

#+RESULTS:
: /opt/homebrew/Caskroom/freac/.metadata/INSTALL_RECEIPT.json
: /opt/homebrew/Caskroom/freac/.metadata/config.json
: /opt/homebrew/Caskroom/freac/.metadata/1.1.7/20260628144058.709/Casks/freac.internal.json
: /opt/homebrew/Caskroom/freac/1.1.7/Readme
: /opt/homebrew/Caskroom/freac/1.1.7/Readme.de
: /opt/homebrew/Caskroom/freac/1.1.7/Copying
: /opt/homebrew/Caskroom/freac/1.1.7/freac.app

** Help

#+begin_src shell :results output
  ls -l /opt/homebrew/Caskroom/freac/1.1.7/freac.app/Contents
#+end_src

#+RESULTS:
: total 40
: -rw-r--r--@  1 mwhipple  staff  5244 Mar  5  2023 CodeResources
: drwxr-xr-x@  4 mwhipple  staff   128 Mar  5  2023 Frameworks
: -rw-r--r--@  1 mwhipple  staff  7969 Mar  5  2023 Info.plist
: drwxr-xr-x@  4 mwhipple  staff   128 Mar  5  2023 MacOS
: -rw-r--r--@  1 mwhipple  staff     8 Mar  5  2023 PkgInfo
: drwxr-xr-x@ 13 mwhipple  staff   416 Mar  5  2023 Resources
: drwxr-xr-x@  3 mwhipple  staff    96 Mar  5  2023 _CodeSignature

#+begin_src shell :results output
  ls -lR /opt/homebrew/Caskroom/freac/1.1.7/freac.app/Contents/MacOS
#+end_src

#+RESULTS:
: total 672
: -rwxr-xr-x@ 1 mwhipple  staff  169248 Mar  5  2023 freac
: -rwxr-xr-x@ 1 mwhipple  staff  169216 Mar  5  2023 freaccmd

~freac~ runs the GUI, but ~freaccmd~ provides the CLI.

#+begin_src shell :results output
  /opt/homebrew/Caskroom/freac/1.1.7/freac.app/Contents/MacOS/freaccmd --help
#+end_src

#+RESULTS:
#+begin_example
++ WARN: cdio_get_default_device() - No CD/DVD/BD media - returning NULL
++ WARN: cdio_get_default_device() - No CD/DVD/BD media - returning NULL
fre:ac - free audio converter v1.1.7 (ARM64) command line interface
Copyright (C) 2001-2023 Robert Kausch

Usage:	freaccmd [options] [--] [encoder options] [file(s)]

  --encoder=<id>  | -e <id>	Specify the encoder to use (default is LAME)
  --help=<id>     | -h <id>	Print help for encoder specific options

                    -d <dir>	Specify output directory for encoded files
                    -o <file>	Specify output file name in single file mode
  --pattern=<pat> | -p <pat>	Specify output file name pattern (default is "<filename>")

  --superfast			Enable SuperFast mode
  --threads=<n>			Specify number of threads to use in SuperFast mode

  --split-chapters		Split to individual chapters if chapter tags are present

  --add-cover=<file>		Add front cover image from file (.png or .jpg)
  --add-cover-back=<file>	Add back cover image from file (.png or .jpg)

  --cuesheet[=<file>]		Create a cue sheet of the conversion results
  --playlist[=<file>]		Create a playlist containing the conversion results

  --ignore-chapters		Do not write chapter information to tags
  --ignore-coverart		Do not write cover images to tags

  --list-configs		Print a list of available configurations
  --config=<cfg>		Specify configuration to use

  --quiet			Do not print any messages

Use -- to separate freaccmd options from encoder options if both have the same name.

Encoder <id> can be one of:

	coreaudio, flac, lame, meh, mac, mpc, vorbis, opus, sndfile, speex, wv,
	ffmpeg-wma, sndfile-wave
#+end_example
